Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection
Serialization structure for AnalysisCrossSection.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Name
The name of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Calculated
This indicates whether the cross section values have been calculated.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._A
The cross section area (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Avy
The shear area for loads parallel to the Y-axis (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Avz
The shear area for loads parallel to the Z-axis (m2) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._It
The torsion moment (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Iw
The warping constant (m6) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Iy
The radius of gyration about Y-axis (m) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Iyy
The moment of inertia about Y-axis (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Iz
The radius of gyration about Z-axis (m) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Izz
The moment of inertia about Z-axis (m4) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Wyy
The elastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Wzz
The elastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Wplyy
The plastic modulus about Y-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._Wplzz
The plastic modulus about Z-axis (m3) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection._G
The mass per unit of length (kg/m) of the analysis cross section.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.ToStruct(Tekla.Structures.Analysis.AnalysisCrossSection)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection.FromStruct(Tekla.Structures.Analysis.AnalysisCrossSection)
DO NOT USE! For internal usage only!
P: P.